## DataFrame 객체 생성

In [1]:
data = { #리스트를 포함한 딕셔너리
    '이름':['홍길동', '이사랑', '강백호', '김지수', '박희수'],
    '학과':['웹공학', '전자', '컴퓨터', '법', '역사문화'],
    'AI':[90, 85, 100, 90, 90],
    'Python':[100, 88, 90, 95 ,85],
    '데이터 분석': [80, 90, 100, 80, 88]
}
data

{'이름': ['홍길동', '이사랑', '강백호', '김지수', '박희수'],
 '학과': ['웹공학', '전자', '컴퓨터', '법', '역사문화'],
 'AI': [90, 85, 100, 90, 90],
 'Python': [100, 88, 90, 95, 85],
 '데이터 분석': [80, 90, 100, 80, 88]}

In [2]:
import pandas as pd
df = pd.DataFrame(data)
df

    이름    학과   AI  Python  데이터 분석
0  홍길동   웹공학   90     100      80
1  이사랑    전자   85      88      90
2  강백호   컴퓨터  100      90     100
3  김지수     법   90      95      80
4  박희수  역사문화   90      85      88

In [3]:
df[['이름', 'AI', 'Python']]

    이름   AI  Python
0  홍길동   90     100
1  이사랑   85      88
2  강백호  100      90
3  김지수   90      95
4  박희수   90      85

In [4]:
df = pd.DataFrame(data, index = ['1번', '2번', '3번', '4번', '5번'])
df

     이름    학과   AI  Python  데이터 분석
1번  홍길동   웹공학   90     100      80
2번  이사랑    전자   85      88      90
3번  강백호   컴퓨터  100      90     100
4번  김지수     법   90      95      80
5번  박희수  역사문화   90      85      88

In [5]:
df.describe()

               AI     Python      데이터 분석
count    5.000000    5.00000    5.000000
mean    91.000000   91.60000   87.600000
std      5.477226    5.94138    8.294577
min     85.000000   85.00000   80.000000
25%     90.000000   88.00000   80.000000
50%     90.000000   90.00000   88.000000
75%     90.000000   95.00000   90.000000
max    100.000000  100.00000  100.000000

In [6]:
df['AI'].max()

100

## DataFrame 객체 생성 연습

In [7]:
data2 = { #리스트를 포함한 딕셔너리
    '이름':['홍의사', '이교사', '강코딩', '김사장', '박비행'],
    '반':['A', 'B', 'C', 'D', 'E'],
    '학번':[10000, 10001, 10002, 10003, 10004],
    '취미':['운동', '여행', '게임', '영화감상' ,'그림그리기'],
    '장래희망': ['의사', '교사', '프로그래머', 'CEO', '파일럿']
}
data2

{'이름': ['홍의사', '이교사', '강코딩', '김사장', '박비행'],
 '반': ['A', 'B', 'C', 'D', 'E'],
 '학번': [10000, 10001, 10002, 10003, 10004],
 '취미': ['운동', '여행', '게임', '영화감상', '그림그리기'],
 '장래희망': ['의사', '교사', '프로그래머', 'CEO', '파일럿']}

In [8]:
import pandas as pd
df2 = pd.DataFrame(data2)
df2

    이름  반     학번     취미   장래희망
0  홍의사  A  10000     운동     의사
1  이교사  B  10001     여행     교사
2  강코딩  C  10002     게임  프로그래머
3  김사장  D  10003   영화감상    CEO
4  박비행  E  10004  그림그리기    파일럿

In [9]:
df2 = pd.DataFrame(data2, index = ['1번', '2번', '3번', '4번', '5번'])
df2

     이름  반     학번     취미   장래희망
1번  홍의사  A  10000     운동     의사
2번  이교사  B  10001     여행     교사
3번  강코딩  C  10002     게임  프로그래머
4번  김사장  D  10003   영화감상    CEO
5번  박비행  E  10004  그림그리기    파일럿